app/controllers/players_controller.rb

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-05-05 06:23:05.592949"], ["updated_at", "2018-05-05 06:23:05.592949"]]

    def set_player
      @player = Player.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]