app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
  def index
    @registrations = Registration.all

INSERT INTO "registrations" ("UserName", "FirstName", "Password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["UserName", "abhay0806"], ["FirstName", "abhay"], ["Password", "qwerty"], ["created_at", "2018-05-04 10:19:01.598252"], ["updated_at", "2018-05-04 10:19:01.598252"]]
---
  def create
    @registration = Registration.new(registration_params)

    respond_to do |format|
      if @registration.save

DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 2]]
---
  def destroy
    @registration.destroy

SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_registration
      @registration = Registration.find(params[:id])